In [69]:
import numpy as np

In [70]:
import pandas as pd

In [71]:
sw = pd.Series([10,20,30,40,50],index = ['mon','tue','wed','thur','fri'])

In [72]:
print(sw)

mon     10
tue     20
wed     30
thur    40
fri     50
dtype: int64

In [73]:
sw.index = [70,80,90,69,78]

In [74]:
print(sw)

70    10
80    20
90    30
69    40
78    50
dtype: int64

DATAFRAME

In [75]:
import pandas as pd
apple = pd.Series([2,7,8,9])
orange = pd.Series([5,4,3,2])
data1 = {'apples': apple,'oranges':orange}
fruit = pd.DataFrame(data1)
print(fruit)

   apples  oranges
0       2        5
1       7        4
2       8        3
3       9        2

In [76]:
data = {'states':['UK','America','Malysia'],'Year':[2009,2003,2002],'Pop':[1.2,3.2,6.2]}
data2 = pd.DataFrame(data, index = ['a','b','c'])

In [77]:
print(data2)

    states  Year  Pop
a       UK  2009  1.2
b  America  2003  3.2
c  Malysia  2002  6.2

In [78]:
data3 = pd.DataFrame(data, columns = ['Year','states','Pop'])

In [79]:
print(data3)

   Year   states  Pop
0  2009       UK  1.2
1  2003  America  3.2
2  2002  Malysia  6.2

In [80]:
data4 = pd.DataFrame(data, columns = ['Year','states','Pop','debt'], index = ['one','two','three'])
data4

       Year   states  Pop debt
one    2009       UK  1.2  NaN
two    2003  America  3.2  NaN
three  2002  Malysia  6.2  NaN

In [81]:
data4.columns

Index(['Year', 'states', 'Pop', 'debt'], dtype='object')

In [82]:
data4.index

Index(['one', 'two', 'three'], dtype='object')

In [91]:
data4.loc

In [85]:
print(data)

{'states': ['UK', 'America', 'Malysia'], 'Year': [2009, 2003, 2002], 'Pop': [1.2, 3.2, 6.2]}

In [122]:
data['states']#key related value all

['UK', 'America', 'Malysia']

In [87]:
data1['apples']

0    2
1    7
2    8
3    9
dtype: int64

In [103]:
data4.states

one           UK
two      America
three    Malysia
Name: states, dtype: object

In [104]:
print(data4)

       Year   states  Pop debt
one    2009       UK  1.2  NaN
two    2003  America  3.2  NaN
three  2002  Malysia  6.2  NaN

In [105]:
data4.loc['one']

Year      2009
states      UK
Pop        1.2
debt       NaN
Name: one, dtype: object

In [123]:
ln = len(data4)

In [124]:
range = np.arange(ln)

In [125]:
data4['debt'] = range

In [126]:
data4

       Year   states  Pop  debt
one    2009       UK  1.2     0
two    2003  America  3.2     1
three  2002  Malysia  6.2     2

In [133]:
seri = pd.Series([1,3,5],index = ['one','two','three'])

In [134]:
data4['debt'] = seri

In [135]:
data4

       Year   states  Pop  debt
one    2009       UK  1.2     1
two    2003  America  3.2     3
three  2002  Malysia  6.2     5

In [136]:
seri = pd.Series([1,3,5],index = ['one','three','four'])
data4['debt'] = seri
data4

       Year   states  Pop  debt
one    2009       UK  1.2   1.0
two    2003  America  3.2   NaN
three  2002  Malysia  6.2   3.0

In [168]:
frame = pd.DataFrame(np.random.randn(4,3), columns = list('bde'), index = ['utah','ohio','texas','orgon'])

In [169]:
frame

              b         d         e
utah  -0.183626  0.940138  1.143380
ohio  -0.562362  1.161934  0.381735
texas -0.234082 -2.308058  0.363523
orgon  0.811269  1.148883  1.260739

In [170]:
f = np.abs(frame)
f

              b         d         e
utah   0.183626  0.940138  1.143380
ohio   0.562362  1.161934  0.381735
texas  0.234082  2.308058  0.363523
orgon  0.811269  1.148883  1.260739

In [171]:
print(frame['d'].min())
print(frame['d'].max())

-2.3080578929938182
1.1619337129923022

In [172]:
f = lambda x : x.max() - x.min()
df = frame.apply(f)
print(df)

b    1.373632
d    3.469992
e    0.897216
dtype: float64

In [173]:
df1 = frame.apply(f, axis = 1)
print(df1)

utah     1.327006
ohio     1.724296
texas    2.671581
orgon    0.449469
dtype: float64

In [174]:
frame

              b         d         e
utah  -0.183626  0.940138  1.143380
ohio  -0.562362  1.161934  0.381735
texas -0.234082 -2.308058  0.363523
orgon  0.811269  1.148883  1.260739

In [175]:
frame.drop('d',axis = 1,inplace = True)

In [176]:
frame

              b         e
utah  -0.183626  1.143380
ohio  -0.562362  0.381735
texas -0.234082  0.363523
orgon  0.811269  1.260739

In [177]:
frame.drop(['ohio'], inplace = True)

In [178]:
frame

              b         e
utah  -0.183626  1.143380
texas -0.234082  0.363523
orgon  0.811269  1.260739

In [182]:
datas = pd.DataFrame(np.arange(8).reshape(2,4),columns = ['a','b','c','d'],index = ['three','one'])

In [183]:
datas

       a  b  c  d
three  0  1  2  3
one    4  5  6  7

In [192]:
datas.sort_index(axis = 1,ascending = False)

       d  c  b  a
three  3  2  1  0
one    7  6  5  4

In [195]:
dat = pd.DataFrame(np.arange(30).reshape(5,6),columns = ['a','b','c','d','e','f'],index = ['three','one','four','five','six'])

In [196]:
dat

        a   b   c   d   e   f
three   0   1   2   3   4   5
one     6   7   8   9  10  11
four   12  13  14  15  16  17
five   18  19  20  21  22  23
six    24  25  26  27  28  29

In [199]:
dat.rank( axis = 1,ascending = False, method  = 'max')

         a    b    c    d    e    f
three  6.0  5.0  4.0  3.0  2.0  1.0
one    6.0  5.0  4.0  3.0  2.0  1.0
four   6.0  5.0  4.0  3.0  2.0  1.0
five   6.0  5.0  4.0  3.0  2.0  1.0
six    6.0  5.0  4.0  3.0  2.0  1.0